<?Php 

// $tovars = [
//     [0, 'Бленд Амхара', 'Дивовижно оксамитовий бленд, огортаючий 
//     своїм п\'янким ароматом, даруючий неповторний смак з нотами чорного шоколаду, 
//     смажених горiхiв i ледве помiтною ягiдної кислинкою. Рекомендуємо для приготування в 
//     джезвi, гейзерi, еспресо. Співвідношення: арабіка 100%.', 170.00, 'amxara.jpg'],
//     [1, 'Бленд Ван Гог','Купаж складається з двох сортiв арабiки та 
//     одного сорту робусти. Смак багатий, насичений з яскраво вираженими смаковими нотами горiха 
//     в пiслясмаку. Легка гiрчинка. Низька, делiкатна кислотнiсть. В ароматi легкий вiдтiнок спецiй. 
//     Спiввiдношення: арабiка 70% / робуста 30%.', 160.00, 'van-gog.jpg'],
//     [2, 'Бленд Фрiда', 'Цей бленд кави в зернах арабiка, має гарне тiло, середню 
//     кислотнiсть i iнтенсивний аромат. У чашцi ягiдна фруктовiсть з\'єднується зi смаком 
//     сушеної вишнi i шоколадним смаком. Спiввiдношення: 100% арабiка. 
//     Купаж пiвденно-американської i африканської арабiки.', 205.00, 'frida.jpg'],
//     [3, 'Бленд Домiнiк', 'Добре збалансована сумiш свiжообсмаженої кави iз 
//     оксамитовим смаком, нотами горiха i гiркуватiстю 
//     какао, змiшаними з кислинкою цитрусових 
//     i зеленого винограду. Стiйкий, яскраво-виражений аромат. Спiввiдношення: 
//     100% арабiка. Купаж африканської, пiвденно-американської i iндiйської арабiки.', 170.00, 'dominik.jpg'],
//     [4, 'Бленд Гоген', 'Класичний iталiйський купаж арабiки i робусти для 
//     поцiновувачiв мiцної кави. Щiльне тiло напою з густою крема i гiркуватим 
//     пiслясмаком чорного шоколаду. Низька кислотнiсть. Глибокий аромат. 
//     Спiввiдношення: арабiка 50% / робуста 50% . Складається з двох сортiв арабiки 
//     та двох сортiв робусти.', 145.00, 'gogen.jpg'],
//     [5, 'Бленд Пiкассо', 'Цей купаж кави є 
//     поєднанням Американської i Африканської арабiки з невеликим додаванням 
//     робусти. Вас чекає ягiдно-горiховий смак з шоколадним смаком i 
//     характерною кислинкою чорницi та лохини. Iдеальний баланс кислотностi i гiркоти. 
//     Спiввiдношення: арабiка 80% / робуста 20%.', 165.00, 'pikasso.jpg'],
// ];
// file_put_contents('../storage/tovar.ser', serialize($tovars));

function allTovar($filename)
{
 $fContent = file_get_contents($filename);
 $tovars = unserialize($fContent);
 return $tovars ? $tovars : [];
}

